package org.deloys.three.org.deploys.three.lessons.lesson07.homeworks

//1. Используя вложенный цикл реализовать таблицу умножения, как на картинке.
//2. Напишите функцию, которая суммирует числа от 1 до 'arg' с помощью цикла for. 'arg' - целочисленный аргумент функции.
//3. Напишите функцию, которая вычисляет факториал числа 'arg' с использованием цикла while.
//4. Напишите функцию, которая находит сумму всех четных чисел от 2 до 'arg', используя цикл while.
//5. Напишите функцию, которая используя вложенные циклы while, выведет заполненный прямоугольник размером 5x3 из символов *.
//6. Напишите функцию, которая используя цикл for найдёт суммы чётных и нечётных значений чисел от 1 до arg.